import {
  galiaKiev,
  olenaKiev,
  olena2Kiev,
  valentinaKiev,
} from '../assets/icons/index';

export interface FeedbackItem {
  id: number;
  name: string;
  city: string;
  text: string;
  avatar: string;
  rate: number;
}

export const feedbacksData = {
  title: 'Ваші враження — наша гордість',
  list: [
    {
      id: 1,
      name: 'Олена',
      city: 'Київ',
      text: 'Замовляла тут вперше — і це любов з першого дотику! Білизна дуже ніжна, приємна до тіла, якість — на висоті. Усе прийшло гарно запаковане, із милою листівкою 💌 Дякую вам за турботу та жіночність у кожній деталі! Буду замовляти ще 💕',
      avatar: olenaKiev,
      rate: 5,
    },
    {
      id: 2,
      name: 'Галина',
      city: 'Київ',
      text: 'Дуже задоволена покупкою! Замовляла комплект мереживної білизни — якість чудова, приємна до тіла тканина, все дуже ніжне і жіночне. Розмір підійшов ідеально. Доставка була швидкою, упаковка красива — підходить навіть як подарунок. Рекомендую Velvet Secrets!',
      avatar: galiaKiev,
      rate: 5,
    },
    {
      id: 3,
      name: 'Олеся',
      city: 'Київ',
      text: 'Дівчата! Якщо ви ще думаєте — не думайте! Це реально один з найкращих магазинів, де я купувала білизну. М’яка, красива, і така комфортна, що не хочеться знімати 🙈',
      avatar: olena2Kiev,
      rate: 5,
    },
    {
      id: 4,
      name: 'Валентина',
      city: 'Київ',
      text: 'Дуже задоволена своїм замовленням! Білизна ніжна, зручна й справді якісна. Усе гарно запаковано, з приємним ароматом тканини. Відчувається любов до деталей 💕 Дякую за сервіс — вже чекаю нову колекцію!',
      avatar: valentinaKiev,
      rate: 5,
    },
  ],
  buttonText: 'Залишити відгук про нас',
};
