import { howMeasureParameters } from '../assets/icons/index';

export const howMeasureParametersData = {
  title: 'Як заміряти свої параметри?',
  steps: [
    {
      title: '1. Зніміть мірки.',
      iconKey: 'woman',
      list: [
        'Обхват грудей – вимірюється по найвищій точці грудей (без пуш-апу).',
        'Обхват під грудьми – щільно під грудьми.',
        'Обхват талії – найвужча частина тіла.',
        'Обхват стегон – по найширшій частині сідниць.',
      ],
    },
    {
      title: '2. Введіть дані в калькулятор.',
      iconKey: 'calculator',
      list: [
        'Введіть мірки у відповідні поля калькулятора (зазвичай у сантиметрах).',
        'Натисніть кнопку “Розрахувати”.',
        'Коли розмір визначений, натисніть кнопку “Знайти мій розмір в каталозі”.',
      ],
    },
    {
      title: '3. Отримайте свій розмір',
      iconKey: 'smile',
      description:
        'Калькулятор автоматично покаже ваш розмір у відповідній системі:',
      list: [
        'Європейська (EU)',
        'Українська (UA)',
        'Англійська (UK)',
        'Американська (US)',
      ],
      note: 'Для білизни — наприклад, 75B, 80C тощо. Порада: Мірки краще знімати в тонкій білизні або без неї, стоячи рівно перед дзеркалом.',
    },
  ],
  images: {
    desktop: howMeasureParameters,
    alt: 'Схема вимірювання параметрів тіла',
  },
};
